Autodesk.Revit.DB.Group.IsCompatibleAttachedDetailGroupType(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Checks if the orientation of the input attached detail group matches the input view's orientation.
Remarks:
Currently, detail groups in perpendicular elevation views (for example, North and East views)
are considered compatible. When showing these detail groups, an error (FailureMessage) based on
id can be generated if the orientation of the annotations do not match the orientation of the
target view (for example, the failure definition DimensionPerpendicularToView). To prevent
displaying detail groups in the wrong view, you can check the OwnerViewId of a detail group
to make sure it matches the view in which you are trying to display it.
view:
The view that the input attached detail group must be compatible with.
detailGroupTypeId:
The attached detail group that will be checked for compatibility with the input view.
Returns:
Returns true if the input attached detail group is compatible with the input view and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
Since:
2019.1

Autodesk.Revit.DB.Group.GetShownAttachedDetailGroupTypeIds(Autodesk.Revit.DB.View)
Returns the attached detail groups which have displayed instances for
this group type in the input view.
view:
The view in which the attached detail groups are displayed.
Returns:
The collection of attached detail group Ids that match this group's type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
Since:
2019.1

Autodesk.Revit.DB.Group.HideAllAttachedDetailGroups(Autodesk.Revit.DB.View)
Hides all the available attached detail groups for this element group type that
are compatible with the input view type.
view:
The view that the attached detail groups must be compatible with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
Since:
2019.1

Autodesk.Revit.DB.Group.HideAttachedDetailGroups(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Hides the element group's attached detail groups of the input group type that
are compatible with the input view.
view:
The view that the attached detail groups must be compatible with.
detailGroupTypeId:
Only attached detail groups of this type will be hidden.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The attached detail group detailGroupTypeId does not match the input view's orientation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
Since:
2019.1

Autodesk.Revit.DB.Group.ShowAllAttachedDetailGroups(Autodesk.Revit.DB.View)
Shows all the available attached detail groups for this element group type that
are compatible with the input view type.
Remarks:
Currently, perpendicular elevation views (for example, North and East views) are considered
compatible when deciding whether or not to allow a detail group to be displayed in a view.
The show operation may generate an error (FailureMessage) based on id if the orientation of the
annotations do not match the orientation of the target view (for example, the failure definition
DimensionPerpendicularToView). To prevent displaying detail groups in the wrong view, you can
check the OwnerViewId of a detail group to make sure it matches the view in which you are trying
to display it.
view:
The view that the attached detail groups must be compatible with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
-or-
This exception is thrown if this group's attached detail groups cannot be found in the current document.
Since:
2019.1

Autodesk.Revit.DB.Group.ShowAttachedDetailGroups(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Shows the element group's attached detail groups of the input group type that
are compatible with the input view.
Remarks:
Currently, perpendicular elevation views (for example, North and East views) are considered
compatible when deciding whether or not to allow a detail group to be displayed in a view.
The show operation may generate an error (FailureMessage) based on id if the orientation of the
annotations do not match the orientation of the target view (for example, the failure definition
DimensionPerpendicularToView). To prevent displaying detail groups in the wrong view, you can
check the OwnerViewId of a detail group to make sure it matches the view in which you are trying
to display it.
view:
The view that the attached detail groups must be compatible with.
detailGroupTypeId:
Only attached detail groups of this type will be shown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The attached detail group detailGroupTypeId does not match the input view's orientation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input group is not a model group and can therefore not have attached detail groups.
-or-
This exception is thrown if the input attached detail group cannot be found in the current document.
Since:
2019.1